I was going to run this, to get it off our hands until after christmas, but I ran into unrelated trouble in the terraform state for both `nasa-veda` and `nasa-ghg`, but not for example `openscapes`.

@yuvipanda I recognize this to be a consequence of https://github.com/2i2c-org/infrastructure/pull/3381 not being applied. I'm not sure if its disruptive for workloads accessing the homedirs currently - but luckily nasa-veda and nasa-ghg are without users atm so I'll go for it.

```terraform
  # aws_efs_mount_target.homedirs will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_efs_mount_target" "homedirs" {
      - availability_zone_id   = "usw2-az2" -> null
      - availability_zone_name = "us-west-2a" -> null
      - dns_name               = "fs-09bd18b3ca23eefa2.efs.us-west-2.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:us-west-2:597746869805:file-system/fs-09bd18b3ca23eefa2" -> null
      - file_system_id         = "fs-09bd18b3ca23eefa2" -> null
      - id                     = "fsmt-0c2bce0a2c878da81" -> null
      - ip_address             = "192.168.30.197" -> null
      - mount_target_dns_name  = "us-west-2a.fs-09bd18b3ca23eefa2.efs.us-west-2.amazonaws.com" -> null
      - network_interface_id   = "eni-0624d23adde1f3de3" -> null
      - owner_id               = "597746869805" -> null
      - security_groups        = [
          - "sg-05fcb798fcd453b9c",
        ] -> null
      - subnet_id              = "subnet-02d33168edc138459" -> null
    }

  # aws_efs_mount_target.homedirs["subnet-02d33168edc138459"] will be created
  + resource "aws_efs_mount_target" "homedirs" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-09bd18b3ca23eefa2"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-05fcb798fcd453b9c",
        ]
      + subnet_id              = "subnet-02d33168edc138459"
    }

  # aws_efs_mount_target.homedirs["subnet-03725b83b8689d3c2"] will be created
  + resource "aws_efs_mount_target" "homedirs" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-09bd18b3ca23eefa2"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-05fcb798fcd453b9c",
        ]
      + subnet_id              = "subnet-03725b83b8689d3c2"
    }

  # aws_efs_mount_target.homedirs["subnet-08630a475fe02d001"] will be created
  + resource "aws_efs_mount_target" "homedirs" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-09bd18b3ca23eefa2"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-05fcb798fcd453b9c",
        ]
      + subnet_id              = "subnet-08630a475fe02d001"
    }
```